{"0":{"name":"Show","direction_from":0,"direction_to":[2,3,4,5,21],"isAnimeObject":false},"1":{"name":"Film","direction_from":0,"direction_to":[],"isAnimeObject":false},"5":{"name":"Something ambitious","direction_from":0,"direction_to":[6,7],"isAnimeObject":false},"6":{"name":"Thriller","direction_from":5,"direction_to":[8,9,10],"isAnimeObject":false},"7":{"name":"Drama","direction_from":5,"direction_to":[22,23,24,32,33],"isAnimeObject":false},"8":{"name":"Popular","direction_from":6,"direction_to":[26,27,28],"isAnimeObject":false},"10":{"name":"Heavy","direction_from":6,"direction_to":[11,12],"isAnimeObject":false},"11":{"name":"Magical Girls","direction_from":10,"direction_to":[13],"isAnimeObject":false},"12":{"name":"Mechas","direction_from":10,"direction_to":[14],"isAnimeObject":false},"13":{"AnimeName":"Mahou Shoujo Madoka★Magica","AnimeDescription":"Madoka Kaname and Sayaka Miki are regular high school girls with regular lives, but all that changes when they encounter Kyuubey, a cat-like magical familiar, and Homura Akemi, the new transfer student.\r\n\r\nKyuubey offers them a proposition: he will grant one of their wishes and in exchange, they will each become a magical girl, gaining enough power to fulfill their dreams. However Homura, a magical girl herself, urges them not to accept the offer since everything is not what it seems.\r\n\r\nA story of hope, despair, and friendship, Mahou Shoujo Madoka★Magica deals with the difficulties of being a magical girl and the price one has to pay to make a dream come true.\r\n\r\n[Written by MAL Rewrite]","AnimePosterPath":"./img/13.jpg","AnimeGenres":["Drama","Magic","Psychological","Thriller"],"AnimeStudios":["Shaft"],"AnimeRating":8.53,"direction_from":11,"direction_to":[],"isAnimeObject":true},"14":{"AnimeName":"Neon Genesis Evangelion","AnimeDescription":"In the year 2015, the world stands on the brink of destruction. Humanity&#039;s last hope lies in the hands of Nerv, a special agency under the United Nations, and their Evangelions, giant machines capable of defeating the Angels who herald Earth&#039;s ruin. Gendou Ikari, head of the organization, seeks compatible pilots who can synchronize with the Evangelions and realize their true potential. Aiding in this defensive endeavor are talented personnel Misato Katsuragi, Head of Tactical Operations, and Ritsuko Akagi, Chief Scientist.\r\n\r\nFace to face with his father for the first time in years, 14-year-old Shinji Ikari&#039;s average life is irreversibly changed when he is whisked away into the depths of Nerv, and into a harrowing new destiny&mdash;he must become the pilot of Evangelion Unit-01 with the fate of mankind on his shoulders.\r\n\r\nWritten by Hideaki Anno, Neon Genesis Evangelion is a heroic tale of a young boy who will become a legend. But as this psychological drama unfolds, ancient secrets beneath the big picture begin to bubble to the surface...\r\n\r\n[Written by MAL Rewrite]","AnimePosterPath":"./img/14.jpg","AnimeGenres":["Action","Dementia","Drama","Mecha","Psychological","Sci-Fi"],"AnimeStudios":["Gainax"],"AnimeRating":8.32,"direction_from":12,"direction_to":[],"isAnimeObject":true},"21":{"name":"A classic","direction_from":0,"direction_to":[54],"isAnimeObject":false},"26":{"name":"Aliens","direction_from":8,"direction_to":[29],"isAnimeObject":false},"27":{"name":"Crime drama with Grim Reaper","direction_from":8,"direction_to":[30],"isAnimeObject":false},"28":{"name":"Hunger Games","direction_from":8,"direction_to":[31],"isAnimeObject":false},"29":{"AnimeName":"Kiseijuu: Sei no Kakuritsu","AnimeDescription":"All of a sudden, they arrived: parasitic aliens that descended upon Earth and quickly infiltrated humanity by burrowing into the brains of vulnerable targets. These insatiable beings acquire full control of their host and are able to morph into a variety of forms in order to feed on unsuspecting prey.\r\n \r\nSixteen-year-old high school student Shinichi Izumi falls victim to one of these parasites, but it fails to take over his brain, ending up in his right hand instead. Unable to relocate, the parasite, now named Migi, has no choice but to rely on Shinichi in order to stay alive. Thus, the pair is forced into an uneasy coexistence and must defend themselves from hostile parasites that hope to eradicate this new threat to their species.\r\n\r\n[Written by MAL Rewrite]","AnimePosterPath":"./img/29.jpg","AnimeGenres":["Action","Drama","Horror","Psychological","Sci-Fi","Seinen"],"AnimeStudios":["Madhouse"],"AnimeRating":8.61,"direction_from":26,"direction_to":[],"isAnimeObject":true},"30":{"AnimeName":"Death Note","AnimeDescription":"A shinigami, as a god of death, can kill any person&mdash;provided they see their victim's face and write their victim's name in a notebook called a Death Note. One day, Ryuk, bored by the shinigami lifestyle and interested in seeing how a human would use a Death Note, drops one into the human realm.\r\n\r\nHigh school student and prodigy Light Yagami stumbles upon the Death Note and&mdash;since he deplores the state of the world&mdash;tests the deadly notebook by writing a criminal's name in it. When the criminal dies immediately following his experiment with the Death Note, Light is greatly surprised and quickly recognizes how devastating the power that has fallen into his hands could be.            \r\n\r\nWith this divine capability, Light decides to extinguish all criminals in order to build a new world where crime does not exist and people worship him as a god. Police, however, quickly discover that a serial killer is targeting criminals and, consequently, try to apprehend the culprit. To do this, the Japanese investigators count on the assistance of the best detective in the world: a young and eccentric man known only by the name of L.\r\n\r\n[Written by MAL Rewrite]","AnimePosterPath":"./img/30.jpg","AnimeGenres":["Mystery","Police","Psychological","Supernatural","Thriller"],"AnimeStudios":["Madhouse"],"AnimeRating":8.73,"direction_from":27,"direction_to":[],"isAnimeObject":true},"31":{"AnimeName":"Mirai Nikki (TV)","AnimeDescription":"Lonely high school student, Yukiteru Amano, spends his days writing a diary on his cellphone, while conversing with his two seemingly imaginary friends Deus Ex Machina, who is the god of time and space, and Murmur, the god&#039;s servant. Revealing himself to be an actual entity, Deus grants Yukiteru a &quot;Random Diary,&quot; which shows highly descriptive entries based on the future and forces him into a bloody battle royale with 11 other holders of similarly powerful future diaries.\r\n\r\nWith the last person standing designated as the new god of time and space, Yukiteru must find and kill the other 11 in order to survive. He reluctantly teams up with his obsessive stalker Yuno Gasai (who also possesses such a diary), and she takes it upon herself to ensure his safety. But there&#039;s more to the girl than meets the eye, as she might have other plans for her unrequited love...\r\n\r\n[Written by MAL Rewrite]","AnimePosterPath":"./img/31.jpg","AnimeGenres":["Action","Mystery","Psychological","Shounen","Supernatural","Thriller"],"AnimeStudios":["Asread"],"AnimeRating":8.13,"direction_from":28,"direction_to":[],"isAnimeObject":true},"32":{"name":"Serious","direction_from":7,"direction_to":[34,35,36,37],"isAnimeObject":false},"33":{"name":"Feels","direction_from":7,"direction_to":[44,45],"isAnimeObject":false},"34":{"name":"Science Fiction","direction_from":32,"direction_to":[38,39],"isAnimeObject":false},"37":{"name":"Postapocalyptical rural utopa","direction_from":32,"direction_to":[43],"isAnimeObject":false},"38":{"name":"Space Garbage Collectors","direction_from":34,"direction_to":[41],"isAnimeObject":false},"39":{"name":"Epic Space Opera","direction_from":34,"direction_to":[40,42],"isAnimeObject":false},"41":{"AnimeName":"Planetes","AnimeDescription":"In 2075, space travel is no longer just a dream, but an everyday reality for mankind. Advancements in science and technology have led to the colonization of the moon, the commercialization of outer space, and the formation of large space corporations. Ai Tanabe, an upbeat woman whose interests lie in the cosmos, joins Technora Corporation as a member of their Debris Section, a department dedicated to the removal of dangerous space junk between the orbits of the Earth and Moon.\r\n\r\nHowever, Ai soon discovers how unappreciated her job is. As the laughingstock of Technora, the Debris Section is severely understaffed, poorly funded, and is forced to use a dilapidated spaceship nicknamed the &quot;Toy Box&quot; for debris retrieval. Undeterred, Ai perseveres and gradually becomes acquainted with the strange personalities that make up the Debris Section&#039;s staff, such as the bumbling but good-natured chief clerk Philippe Myers; the mysterious and tight-lipped temp worker Edelgard Rivera; and the hotheaded and passionate Hachirota Hoshino, who longs for a spaceship to call his own.\r\n\r\nWinner of the Seiun Award in 2005, Planetes is an unconventional sci-fi series that portrays the vastness of space as a backdrop for the personal lives of ordinary people&mdash;people who may have been born on Earth, but whose hopes and dreams lie amongst the stars.\r\n\r\n[Written by MAL Rewrite]","AnimePosterPath":"./img/41.jpg","AnimeGenres":["Drama","Romance","Sci-Fi","Seinen","Space"],"AnimeStudios":["Sunrise"],"AnimeRating":8.39,"direction_from":38,"direction_to":[],"isAnimeObject":true},"42":{"AnimeName":"Ginga Eiyuu Densetsu","AnimeDescription":"For 150 years the galaxy has been locked in an interstellar war between the Galactic Empire and the Free Planets Alliance, fighting battles with thousands of spaceships and millions of soldiers on both sides. The crumbling Goldenbaum dynasty rules the Empire while the Alliance is in an increasingly dysfunctional democratic state.\r\n\r\nTwo new commanders enter the stage: Imperial Admiral Reinhard von Lohengramm and the FPA&#039;s Yang Wen-Li. Reinhard is a talented minor aristocrat given a high station&mdash;and a powerful grudge&mdash;after the Kaiser took his older sister as a concubine. Wen-Li originally joined the military only to fund his university education, but has become a brilliant though reluctant leader. Each begins to attract a circle of similarly gifted soldiers, generals and thinkers around him, and in time the rivalry between these two very different men will shatter the existing stalemate. As they deal with superiors and subordinates, maneuver through personal and political problems, plot strategies and fight battles, both will bend the course of events to their will and, in turn, be tested and changed by the greatest war in human history!\r\n\r\nLegend of the Galactic Heroes is a vast, sentimental and thoughtful military space opera. This 110-episode OVA is the central part of the franchise, and the other connected titles are supplements to it. \r\n","AnimePosterPath":"./img/42.jpg","AnimeGenres":["Drama","Military","Sci-Fi","Space"],"AnimeStudios":["Artland"],"AnimeRating":9.09,"direction_from":39,"direction_to":[],"isAnimeObject":true},"43":{"AnimeName":"Shinsekai yori","AnimeDescription":"Following a sudden outbreak of psychokinesis in 0.1% of the population, a rapid transformation swept the world. The godlike ability to manipulate matter remotely turned many power wielders to violence, inciting a long period of upheaval. Finally, after a chaotic era shaped by the rise and fall of oppressive regimes, the psychic humans were able to achieve a fragile peace by isolating their society, creating a new world bound by complex rules.\r\n\r\nIn the town of Kamisu 66, 12-year-old Saki Watanabe has just awakened to her powers and is relieved to rejoin her friends&mdash;the mischievous Satoru Asahina, the shy Mamoru Itou, the cheerful Maria Akizuki, and Shun Aonuma, a mysterious boy whom Saki admires&mdash;at Sage Academy, a special school for psychics. However, unease looms as Saki begins to question the fate of those unable to awaken to their powers, and the children begin to get involved with secretive matters such as the rumored Tainted Cats said to abduct children.\r\n\r\nShinsekai yori tells the unique coming-of-age story of Saki and her friends as they journey to grow into their roles in the supposed utopia. Accepting these roles, however, might not come easy when faced with the dark and shocking truths of society, and the impending havoc born from the new world.\r\n\r\n[Written by MAL Rewrite]","AnimePosterPath":"./img/43.jpg","AnimeGenres":["Drama","Horror","Mystery","Sci-Fi","Supernatural"],"AnimeStudios":["A-1 Pictures"],"AnimeRating":8.54,"direction_from":37,"direction_to":[],"isAnimeObject":true},"44":{"name":"Warm Feels","direction_from":33,"direction_to":[52,53],"isAnimeObject":false},"45":{"name":"Sad","direction_from":33,"direction_to":[46,47],"isAnimeObject":false},"46":{"name":"Overcoming grief","direction_from":45,"direction_to":[48,49],"isAnimeObject":false},"47":{"name":"long buildup","direction_from":45,"direction_to":[50,51],"isAnimeObject":false},"48":{"AnimeName":"Ano Hi Mita Hana no Namae wo Bokutachi wa Mada Shiranai.","AnimeDescription":"After a tragic accident during their childhood, Jinta and his group of friends split apart and live separate lives. Now in high school, the group is drawn together once more by an unknown force. AnoHana, short for Ano Hi Mita Hana no Namae wo Bokutachi wa Mada Shiranai (We Still Don&#039;t Know the Name of the Flower We Saw That Day), is a drama and slice-of-life series following the lives of these students and the friendship they once had, as they rediscover guilt, anger, friendship, happiness, and so much more.\r\n\r\nWill Jinta Yadomi, Tetsudou Hisakawa, Naruko Anjou, Matsuyuki Atsumu, and Chiriko Tsurumi find the strength to repair broken bonds?","AnimePosterPath":"./img/48.jpg","AnimeGenres":["Drama","Slice of Life","Supernatural"],"AnimeStudios":["A-1 Pictures"],"AnimeRating":8.65,"direction_from":46,"direction_to":[],"isAnimeObject":true},"49":{"AnimeName":"Shigatsu wa Kimi no Uso","AnimeDescription":"Music accompanies the path of the human metronome, the prodigious pianist Kousei Arima. But after the passing of his mother, Saki Arima, Kousei falls into a downward spiral, rendering him unable to hear the sound of his own piano.\r\n \r\nTwo years later, Kousei still avoids the piano, leaving behind his admirers and rivals, and lives a colorless life alongside his friends Tsubaki Sawabe and Ryouta Watari. However, everything changes when he meets a beautiful violinist, Kaori Miyazono, who stirs up his world and sets him on a journey to face music again.\r\n\r\nBased on the manga series of the same name, Shigatsu wa Kimi no Uso approaches the story of Kousei&#039;s recovery as he discovers that music is more than playing each note perfectly, and a single melody can bring in the fresh spring air of April.\r\n\r\n[Written by MAL Rewrite]","AnimePosterPath":"./img/49.jpg","AnimeGenres":["Drama","Music","Romance","School","Shounen"],"AnimeStudios":["A-1 Pictures"],"AnimeRating":8.93,"direction_from":46,"direction_to":[],"isAnimeObject":true},"50":{"AnimeName":"Clannad","AnimeDescription":"Tomoya Okazaki is a delinquent who finds life dull and believes he&#039;ll never amount to anything. Along with his friend Sunohara, he skips school and plans to waste his high school days away.\r\n\r\nOne day while walking to school, Tomoya passes a young girl muttering quietly to herself.  Without warning she exclaims &quot;Anpan!&quot; (a popular Japanese food) which catches Tomoya&#039;s attention. He soon discovers the girl&#039;s name is Nagisa Furukawa and that she exclaims things she likes in order to motivate herself. Nagisa claims they are now friends, but Tomoya walks away passing the encounter off as nothing.\r\n\r\nHowever, Tomoya finds he is noticing Nagisa more and more around school.  Eventually he concedes and befriends her.  Tomoya learns Nagisa has been held back a year due to a severe illness and that her dream is to revive the school&#039;s drama club.  Claiming he has nothing better to do, he decides to help her achieve this goal along with the help of four other girls.\r\n\r\nAs Tomoya spends more time with the girls, he learns more about them and their problems.  As he attempts to help each girl overcome her respective obstacle, he begins to realize life isn&#039;t as dull as he once thought.\r\n\r\n[Written by MAL Rewrite]","AnimePosterPath":"./img/50.jpg","AnimeGenres":["Comedy","Drama","Romance","School","Slice of Life","Supernatural"],"AnimeStudios":["Kyoto Animation"],"AnimeRating":8.34,"direction_from":47,"direction_to":[],"isAnimeObject":true},"51":{"AnimeName":"Clannad: After Story","AnimeDescription":"Clannad: After Story, the sequel to the critically acclaimed slice-of-life series Clannad, begins after Tomoya Okazaki and Nagisa Furukawa graduate from high school. Together, they experience the emotional rollercoaster of growing up. Unable to decide on a course for his future, Tomoya learns the value of a strong work ethic and discovers the strength of Nagisa&#039;s support. Through the couple&#039;s dedication and unity of purpose, they push forward to confront their personal problems, deepen their old relationships, and create new bonds.\r\n\r\nTime also moves on in the Illusionary World. As the plains grow cold with the approach of winter, the Illusionary Girl and the Garbage Doll are presented with a difficult situation that reveals the World&#039;s true purpose.\r\n\r\nBased on the visual novel by Key and produced by Kyoto Animation, Clannad: After Story is an impactful drama highlighting the importance of family and the struggles of adulthood.\r\n\r\n[Written by MAL Rewrite]","AnimePosterPath":"./img/51.jpg","AnimeGenres":["Drama","Fantasy","Romance","Slice of Life","Supernatural"],"AnimeStudios":["Kyoto Animation"],"AnimeRating":9.09,"direction_from":47,"direction_to":[],"isAnimeObject":true},"52":{"AnimeName":"Sakurasou no Pet na Kanojo","AnimeDescription":"When abandoned kittens and his good conscience force second year Sorata Kanda to move into Suimei High School&rsquo;s infamous Sakura Hall, the satellite dorm and its eccentric, misfit residents turn his life upside down. The decidedly average Sorata finds it difficult to fit in with the bizarre collection of dorm residents like Misaki, an energetic animator; Jin, a playwright playboy; Ryuunosuke, a reclusive programmer; and Chihiro, the dorm manager, art teacher, and party girl.\r\n\r\nSorata's friend Nanami, a second year student and aspiring voice actress, pushes him to find new owners for the many cats so that he can quickly move back into the regular dorms. However, his desire to escape Sakura Hall wavers when the pet-like and infantile second year Mashiro Shiina, a world-class artistic savant looking to become a mangaka, transfers in during the spring trimester and quickly latches onto him.\r\n\r\nSupported by each other's quirks, Sorata and Mashiro come out of their shells and trigger change in the lives of those around them. Based on the light novel series of the same name, Sakurasou no Pet na Kanojo explores the fine threads connecting talent, hard work, romance, and friendship with its ensemble cast.\r\n\r\n[Written by MAL Rewrite]","AnimePosterPath":"./img/52.jpg","AnimeGenres":["Comedy","Drama","Romance","School","Slice of Life"],"AnimeStudios":["J.C.Staff"],"AnimeRating":8.42,"direction_from":44,"direction_to":[],"isAnimeObject":true},"53":{"AnimeName":"Hanasaku Iroha","AnimeDescription":"After her single mother decides to run off with a boyfriend to dodge debt collectors, the young and energetic Ohana is sent to live with her grandmother. However, her grandmother is the strict owner of a hot springs inn and requires her to work at the inn to pay for her living expenses. Although Ohana is unhappy about this situation at first, she decides to make the best of her situation and work hard. Ohana's life is suddenly filled with fun, mischief, and drama!\n\n[Written by MAL Rewrite]","AnimePosterPath":"./img/53.jpg","AnimeGenres":["Comedy","Drama","Seinen","Slice of Life"],"AnimeStudios":["P.A. Works"],"AnimeRating":8.04,"direction_from":44,"direction_to":[],"isAnimeObject":true},"54":{"AnimeName":"Cowboy Bebop","AnimeDescription":"In the year 2071, humanity has colonized several of the planets and moons of the solar system leaving the now uninhabitable surface of planet Earth behind. The Inter Solar System Police attempts to keep peace in the galaxy, aided in part by outlaw bounty hunters, referred to as &quot;Cowboys&quot;. The ragtag team aboard the spaceship Bebop are two such individuals.\r\n \r\nMellow and carefree Spike Spiegel is balanced by his boisterous, pragmatic partner Jet Black as the pair makes a living chasing bounties and collecting rewards. Thrown off course by the addition of new members that they meet in their travels&mdash;Ein, a genetically engineered, highly intelligent Welsh Corgi; femme fatale Faye Valentine, an enigmatic trickster with memory loss; and the strange computer whiz kid Edward Wong&mdash;the crew embarks on thrilling adventures that unravel each member&#039;s dark and mysterious past little by little. \r\n\r\nWell-balanced with high density action and light-hearted comedy, Cowboy Bebop is a space Western classic and an homage to the smooth and improvised music it is named after.  \r\n\r\n[Written by MAL Rewrite]","AnimePosterPath":"./img/54.jpg","AnimeGenres":["Action","Adventure","Comedy","Drama","Sci-Fi","Space"],"AnimeStudios":["Sunrise"],"AnimeRating":8.83,"direction_from":21,"direction_to":[],"isAnimeObject":true}}